# Представленные задания для подготовки к экзамену ⏰
### Типа 2:№15124, №18071, №15939, №26974, №33174, №83132, №15618, №35460, №27287, №15970, №16377, №16431
### Типа 8:№78064, №3570, №72566, №55625, №81474, №59744, №7667, №8098, №3206, №17328, №18079, №18491,

### Решения задач:
## №15124
``Логическая функция F задаётся выражением (x ≡ y ) ∨ ((y ∨ z) → x).
Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z.``

```
Переменная 1	       Переменная 2	                      Переменная 3                     Функция
     ???		          ???                                ???                              F
                           1	                              1                               0
                           1	                              0
```

Решение на Python:

```
print("x y z")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            if not((x == y) or ((y or z) <= x)):
                print(x, y, z)
```
Пояснение:
