# Задание по перебору чисел
## Задание 1
### На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
### 1)Строится двоичная запись числа N.
### 2)Затем справа дописываются два разряда: символы 01, если число N чётное, и 10, если нечётно.
### Полученная таким образом запись (В ней на два разряда больше, чем в записи исходного числа N) является двоичной записью искомого числа R. Укажите минимальное число R, большее 130, которое может являться результатом работы этого алгоритма. В ответе это число запишите в десятичной системе.

Решение:
```
n = int(input())
r = bin (n)
print(r)
```
Первое, что мы делаем, это - прописываем команду, что будет переводить заданное число в двоичную систему счисления.
После активации и прописания в строку значения:
``50``
;
Нам выводит ответ:
``0b110010``

`` 0b `` означает - перевод в двоичную систему (bin, бинарная)

Для того чтоб убрать ``0b`` необходимо дописать после ``r = bin(n)`` функцию ``[2:]``

Как это должно выглядить:
```
n = int(input())
r = bin (n)[2:]
print(r)
```
После этого добавления стало выдавать просто ответ ``110010``


Далее, мы сделаем так что "справа дописываются два разряда: символы 01, если число N чётное, и 10, если нечётно."

Для данного действия мы добавлявем следующую часть кода:
```
n = int(input())
r = bin (n)[2:]
print(r)
if n % 2 == 0:
    r += '01'
else:
    r += '10'
print(r)
```




# Решение заданий FOR_Переборные

## Задание 1
Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [10000; 20001], числа, имеющие ровно 5 различных делителей. Выведите эти делители для каждого найденного числа в порядке возрастания.

```python
# Функция для нахождения всех делителей числа
def find_divisors(n):
    divisors = []  # создаем пустой список для делителей
    # Перебираем все числа от 1 до корня из n (делители идут парами)
    for i in range(1, int(n**0.5) + 1):
        if n % i == 0:  # если i является делителем
            divisors.append(i)  # добавляем i в список
            if i != n // i:  # если i не равен парному делителю
                divisors.append(n // i)  # добавляем парный делитель
    return sorted(divisors)  # возвращаем отсортированный список

# Перебираем все числа в заданном диапазоне
for num in range(10000, 20002):
    divisors = find_divisors(num)  # находим делители числа
    if len(divisors) == 5:  # если количество делителей равно 5
        print(f"Число {num}: делители {divisors}")  # выводим результат
```

---

## Задание 2
Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [10000; 12345], простые числа. Выведите сумму этих чисел.

```python
# Функция для проверки, является ли число простым
def is_prime(n):
    if n < 2:  # числа меньше 2 не являются простыми
        return False
    # Проверяем делители от 2 до корня из n
    for i in range(2, int(n**0.5) + 1):
        if n % i == 0:  # если нашелся делитель
            return False  # число составное
    return True  # если делителей нет, число простое

sum_primes = 0  # переменная для накопления суммы
# Перебираем все числа в диапазоне
for num in range(10000, 12346):
    if is_prime(num):  # если число простое
        sum_primes += num  # добавляем его к сумме
print(f"Сумма простых чисел: {sum_primes}")  # выводим результат
```

---

## Задание 3
Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m». Для какого наибольшего натурального числа А формула
(¬ДЕЛ(x, А) ∧ ДЕЛ(x, 4)) → ¬ДЕЛ(x, 9)
тождественно истинна (т.е. принимает значение 1 при любом натуральном значении переменной х)?

```python
# Функция, проверяющая делится ли n на m
def del_(n, m):
    return n % m == 0  # возвращает True, если остаток от деления равен 0

# Перебираем A от наибольшего к наименьшему
for A in range(1000, 0, -1):
    found = True  # предполагаем, что формула истинна для всех x
    # Проверяем различные значения x
    for x in range(1, 1000):
        # Вычисляем значение формулы (импликация a → b равносильна not a or b)
        if not ((not del_(x, A) and del_(x, 4)) <= (not del_(x, 9))):
            found = False  # нашли контрпример
            break
    if found:  # если для всех x формула истинна
        print(f"Наибольшее A: {A}")  # выводим результат
        break
```

---

## Задание 4
Для какого наименьшего числа А формула
(x > 15) ∨ (x < 2y) ∨ (A > x + y)
тождественно истинна для любых целых положительных значений х и у.

```python
# Перебираем A от наименьшего к наибольшему
for A in range(1, 1000):
    found = True  # предполагаем, что формула истинна для всех x,y
    # Проверяем все возможные пары x и y
    for x in range(1, 100):
        for y in range(1, 100):
            # Если все три условия ложны, то формула ложна
            if not ((x > 15) or (x < 2 * y) or (A > x + y)):
                found = False  # нашли контрпример
                break
        if not found:
            break
    if found:  # если для всех x,y формула истинна
        print(f"Наименьшее A: {A}")  # выводим результат
        break
```

---

## Задание 5
Автомат обрабатывает натуральное число N по следующему алгоритму:
1. Строится двоичная запись числа N.
2. Складываются все цифры полученной двоичной записи. В конец записи (справа) дописывается остаток от деления полученной суммы на 2.
3. Предыдущий пункт повторяется для записи с добавленной цифрой.
4. Результат переводится в десятичную систему и выводится на экран.

Какое наибольшее число, меньшее 100, может появиться на экране в результате работы автомата?

```python
# Функция, реализующая алгоритм автомата
def process_number(N):
    binary = bin(N)[2:]  # получаем двоичную запись без префикса '0b'
    # Выполняем два добавления цифр (по условию)
    for _ in range(2):
        sum_digits = binary.count('1')  # считаем количество единиц (сумму цифр)
        binary += str(sum_digits % 2)  # дописываем остаток от деления на 2
    return int(binary, 2)  # переводим обратно в десятичную систему

results = []  # список для хранения результатов
# Перебираем возможные значения N
for N in range(1, 1000):
    result = process_number(N)  # получаем результат работы автомата
    if result < 100:  # если результат меньше 100
        results.append(result)  # добавляем в список
print(f"Наибольшее число < 100: {max(results)}")  # находим максимальное
```

---

## Задание 6
Автомат обрабатывает натуральное число N по следующему алгоритму:
1. Строится двоичная запись числа N.
2. Складываются все цифры полученной двоичной записи. В конец записи (справа) дописывается остаток от деления полученной суммы на 2.
3. Предыдущий пункт повторяется для записи с добавленной цифрой.
4. Результат переводится в десятичную систему и выводится на экран.

При каком наибольшем числе N алгоритм выведет число, меньшее 150?

```python
# Функция, реализующая алгоритм автомата
def process_number(N):
    binary = bin(N)[2:]  # получаем двоичную запись без префикса '0b'
    # Выполняем два добавления цифр (по условию)
    for _ in range(2):
        sum_digits = binary.count('1')  # считаем количество единиц
        binary += str(sum_digits % 2)  # дописываем остаток от деления на 2
    return int(binary, 2)  # переводим обратно в десятичную систему

max_N = 0  # переменная для хранения максимального N
# Перебираем возможные значения N
for N in range(1, 1000):
    if process_number(N) < 150:  # если результат меньше 150
        max_N = N  # запоминаем это N (последнее будет максимальным)
print(f"Наибольшее N: {max_N}")  # выводим результат
```
