# Задания цикла FOR:
## Задание 1.
Рассматривается множество целых чисел, принадлежащих отрезку [1012; 9638], которые делятся на 7 и оканчиваются на 1. Найдите сумму таких чисел.

```python
s = 0
for i in range(1012, 9639):
    if (i % 7 == 0) and (i % 10 == 1):
        s += i
print(s)
```

Программа должна вывести число 656943.

## Задание 2.
Рассматривается множество целых чисел, принадлежащих отрезку [1125; 7856], которые делятся на 3 и не делятся на 7 и 5. Найдите количество таких чисел.

```python
count = 0
for i in range(1125, 7857):
    if (i % 3 == 0) and (i % 7 != 0) and (i % 5 != 0):
        count += 1
print(count)
```

Программа должна вывести число 1538.

## Задание 3.
Рассматривается множество целых чисел, принадлежащих отрезку [100; 999], которые являются палиндромом. Найдите сумму таких чисел.

```python
s = 0
for i in range(100, 1000):
    if str(i) == str(i)[::-1]:
        s += i
print(s)
```

Программа должна вывести число 49500.

## Задание 4.
В программу вводится два натуральных числа: N и K. Выведите на экран последовательность, состоящую из N чисел с разностью K.

```python
N = int(input())
K = int(input())
for i in range(N):
    print(1 + i * K, end=" ")
```

Пример ввода:
```
5
3
```
Пример вывода:
```
1 4 7 10 13
```

## Задание 5.
В программу вводится одно натуральное число N. Выведите на экран все значения функции f(x) = x² + 5x - 7.

```python
N = int(input())
for x in range(0, N + 1):
    print(x * x + 5 * x - 7, end=" ")
```

Пример ввода:
```
10
```
Пример вывода:
```
-7 -1 7 17 29 43 59 77 97 119 143
```

## Задание 6.
В программу вводится натуральное число N, а затем N натуральных чисел. Найдите сумму трёхзначных чисел, делящихся на 7.

```python
N = int(input())
s = 0
for _ in range(N):
    num = int(input())
    if (num % 7 == 0) and (100 <= num <= 999):
        s += num
print(s)
```

Пример ввода:
```
5
15
749
222
17
651
```
Пример вывода:
```
1400
```

## Задание 7.
В программу вводится число N, затем N чисел. Найдите максимальное число, кратное 7 и не кратное 9.

```python
N = int(input())
max_num = -1
for _ in range(N):
    num = int(input())
    if (num % 7 == 0) and (num % 9 != 0):
        if num > max_num:
            max_num = num
print(max_num)
```

Пример ввода:
```
5
15
749
222
17
651
```
Пример вывода:
```
749
```

## Задание 8.
В программу вводится число N, затем N чисел. Найдите минимальное двузначное число, восьмеричная запись которого оканчивается на 3.

```python
N = int(input())
min_num = 1001
for _ in range(N):
    num = int(input())
    if (10 <= num <= 99) and (oct(num)[-1] == '3'):
        if num < min_num:
            min_num = num
if min_num == 1001:
    print(0)
else:
    print(min_num)
```

Пример ввода:
```
5
15
749
222
17
651
```
Пример вывода:
```
0
```

## Задание 9.
В программу вводится число N. Выведите два столбца чисел: слева от 1 до N, справа от N до 1.

```python
N = int(input())
for i in range(1, N + 1):
    print(i, N - i + 1)
```

Пример ввода:
```
5
```
Пример вывода:
```
1 5
2 4
3 3
4 2
5 1
```

## Задание 10.
В программу вводится число N. Определите, является ли оно простым.

```python
N = int(input())
is_prime = True
if N < 2:
    is_prime = False
else:
    for i in range(2, int(N ** 0.5) + 1):
        if N % i == 0:
            is_prime = False
            break
print(is_prime)
```

Пример ввода:
```
7
```
Пример вывода:
```
True
```

## Задание 11.
В программу вводится натуральное число N. Выведите ряд чисел: 1, 0.5, 0.25, ... (N элементов).

```python
N = int(input())
num = 1
for i in range(N):
    print(num, end=" ")
    num /= 2
```

Пример ввода:
```
5
```
Пример вывода:
```
1 0.5 0.25 0.125 0.0625
```
